{"backend": "tensorflow", "keras_version": "2.2.0", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 4, 42, 42], "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "zero_padding2d_1", "config": {"name": "zero_padding2d_1", "data_format": "channels_last", "trainable": true, "padding": [[3, 3], [3, 3]]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D"}, {"name": "conv2d_1", "config": {"kernel_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [5, 5], "activity_regularizer": null, "name": "conv2d_1", "filters": 16, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_1", "config": {"axis": 3, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "epsilon": 0.001, "name": "batch_normalization_1", "scale": true, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "center": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "flatten_1", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"kernel_regularizer": null, "name": "dense_1", "trainable": true, "units": 6, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}]}, "class_name": "Model"}